//=============================================================================
//
// コライダーヘッダ [collider.h]
// Author : GP11A341 21 立花雄太
//
//=============================================================================
#ifndef _COLLIDER_H_
#define _COLLIDER_H_

//*****************************************************************************
// 構造体定義
//*****************************************************************************


//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitCollider(void);							//当たり判定初期化処理
void UninitCollider(void);							//当たり判定終了処理
void UpdateCollider(void);							//当たり判定更新処理
void DrawCollider(void);							//当たり判定描画処理
bool HitBB(D3DXVECTOR4 bb1, D3DXVECTOR4 bb2);		//バウンディングボックスの接触判定関数
#endif
