//=============================================================================
//
// エフェクトヘッダ [effect.h]
// Author : GP11A341 21 立花雄太
//
//=============================================================================
#ifndef _EFFECT_H_
#define _EFFECT_H_

// マクロ定義

//*****************************************************************************
// 構造体定義
//*****************************************************************************
typedef struct {
	bool					active;							//使用or未使用の判定

	D3DXVECTOR3				pos;							// ポリゴンの座標
	D3DXVECTOR3				rot;							// ポリゴンの回転量
	float					scale;							// ポリゴンのスケール
	int						countAnim;						// アニメーションカウント
	int						patternAnim;					// アニメーションパターンナンバー

	D3DXVECTOR3				velocity;						//進む方向を表すベクトル
	float					initSpeed;						//初期スピード
	float					speed;							//進む速さ

	int						animTime;						//アニメーションが切り替わる時間
}EFFECT;

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitEffect(int num);									//エフェクト初期化処理
void UninitEffect(void);										//エフェクト終了処理
void UpdateEffect(void);										//エフェクト更新処理
void DrawEffect(void);											//エフェクト描画処理

#endif
